Revit 2027 API
CompoundStructureLayer.Width Property
 Width of the layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Width { get; set; }
Public Property Width As Double
	Get
	Set
public:
property double Width {
	double get ();
	void set (double value);
}
member Width : float with get, set
Property Value
Double
Remarks
 Can be 0.0 if this is a membrane layer. 0.0 is the default.
See Also
Reference
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace